<template>
   <div class="faq">
      <div class="container">
         <div class="faq__inner">
            <h2>ответы на частые вопросы</h2>
            <div class="faq__list">
               <div class="faq__item" v-for="item in list" :key="item">
                  <div class="faq__item-question">
                     <span v-html="item.question"></span>
                     <span class="faq__item-question-arrow"></span>
                  </div>
                  <div class="faq__item-answer" v-html="item.answer">
                  </div>
               </div>
            </div>
         </div>
      </div>
   </div>
</template>
<script setup>
const list = ref([
   {
      question: 'В чём разница между психологом, психотерапевом и психиатром?',
      answer: 'Психиатр имеет медицинское образование и может прописывать лекарства. Психолог — человек, у которого есть высшее психологическое образование или диплом о переквалификации. Если опираться строго на российское законодательство, то психотерапевт — это врач, который имеет психотерапевтическую специализацию. Однако мы и многие наши коллеги используем слова «психолог» и «психотерапевт» как синонимы, подразумевая под ними немедицинских специалистов, которые получили высшее психологическое + дополнительное образование в одном из психотерапевтических направлений (психоанализ, когнитивно-поведенческая терапия, гештальт-терапия и так далее).',
   },
   {
      question: 'Я могу доверять Вашим психологам?',
      answer: 'Конечно, мы тщательно отбираем специалистов и следим за их квалификацией и профессиональной этикой. Вы можете быть уверены в конфиденциальности и качестве предоставляемых услуг.',
   },
   {
      question: 'Что делать, если мне не понравится психолог?',
      answer: 'Скажите нам об этом, и мы подберём другого специалиста. Бывает, клиент и психолог не подходят друг к другу. Значит, нужно просто продолжить поиски.',
   },
   {
      question: 'Сколько длится одна сессия?',
      answer: '50 минут, если нужно, Вы можете договориться со своим специалистом и проводить сдвоенные сессии.',
   },
   {
      question: 'С какого возраста можно работать с психологом на Вашем сайте?',
      answer: 'Мы работаем с клиентами от 16 лет. Для более молодых требуется согласие родителей или законных представителей.',
   },
   {
      question: 'Забыл заранее перенести сессию. Что делать?',
      answer: 'Если до начала сессии более 24 часов, то в личном кабинете у Вас будет кнопка “Перенести сессию”, если же прошло больше времени, то деньги будут списаны.',
   },
   {
      question: 'Как выбрать психолога, который подойдет?',
      answer: 'При регистрация наша система автоматически рекомендует Вам подходящего специалиста, исходя из Ваших индивидуальных требований и предпочтений.',
   },
   {
      question: 'Не хочу общаться лично с психологом. Есть другие варианты?',
      answer: 'Разумеется, наши специалисты подготовили для Вас необходимую информацию на разные темы для самопомощи. Изучать ее можно в своем темпе и в удобное для Вас время.',
   },
   {
      question: 'Как оформить подписку «Самопомощь»?',
      answer: 'Вы можете оформить подписку на нашем сайте любым удобным способом и из любой точки Мира.',
   },
   {
      question: 'Хочу помочь близкому человеку. Как мне это сделать?',
      answer: 'Вы можете подарить близкому человеку сертификат на определенное количество сессий с психологом, который он сможет активировать при регистрации.',
   },
])
onMounted(() => {
   $(".faq__item")
      .not(":first")
      .each(function () {
         $(this).find(".faq__item-question-arrow").removeClass("active");
         $(this).find(".faq__item-answer").hide("fast");
      });
   $(".faq__item:first")
      .find(".faq__item-question-arrow")
      .addClass("active");
   $(".faq__item").on("click", function () {
      $(".faq__item")
         .not(this)
         .each(function () {
            $(this).find(".faq__item-question-arrow").removeClass("active");
            $(this).find(".faq__item-answer").hide("fast");
         });
      $(this).find(".faq__item-question-arrow").toggleClass("active");
      $(this).find(".faq__item-answer").toggle("fast");
   });
})
</script>